//mock数据
export default{
    getImageListData:()=>{
        return{ 
            code:200,
            data:[
                {
                    name:"1"
                },
                {
                    name:"2"
                },
                {
                    name:"3"
                },
                {
                    name:"4"
                },
                {
                    name:"5"
                },
                {
                    name:"6"
                }
            ]
        }
    },
    getGoodsListData:()=>{
        return{
            code:200,
            data:[
                {
                    name:'1',
                    message:'HUWDI手机2024新款上市N10 旗舰骁龙888 5G全网通 120Hz高刷屏 7800mAh长续航快充 游戏手机 学生拍照 碧空蓝 12G+256G',
                    cost:'1699.00'
                },
                {
                    name:'2',
                    message:'甄选荣耀【2024全新手机】16+512g智能大内存骁龙855处理器 5G全网通 长续航学生价游戏老年人高清大屏百元 远峰蓝【收藏加购送豪礼+免费试用】 8GB+128GB【八核处理器+人脸识别】',
                    cost:'899.00'
                },
                {
                    name:'3',
                    message:'甄选荣耀16+512G智能手机M60 Pro全网通5G骁龙888 长续航游戏老年人学生备用安卓拍照清超大屏2024新款 雅川青【人脸识别+免费试用+收藏加购送豪礼】 8GB+128GB',
                    cost:'899.00'
                },
                {
                    name:'4',
                    message:'Viken【华强北18代顶配版】苹果蓝牙耳机无线Air双耳降噪适用iphone15/14/13/12入耳运动ios无线充五代 【8月原版全功能降噪版】滑动调节音量 【空间音頻+入耳检测+三真电量】',
                    cost:'133.00'
                },
                {
                    name:'5',
                    message:'甄选荣耀骁龙16+512G大内存 智能手机全新14Pro全网通5G双卡 游戏长续航百元安卓美颜学生老人大屏 远峰蓝【收藏加购送礼包】 12GB+512GB【八核处理器/旗舰全新】',
                    cost:'1099.00'
                },
                {
                    name:'6',
                    message:'HAIWUEN平板电脑MetaPad Pro 2024新款骁龙8+平板电脑二合一全网通5G学生上网课游戏电竞ipad超清4K全面屏 珊瑚蓝 PadPro旗舰版16G+128G/键盘+鼠标',
                    cost:'868.00'
                },
                {
                    name:'7',
                    message:'京桐【包安装】全实木衣柜卧室可推拉衣柜简约出租屋储物收纳衣柜 【长160*深50*高200】主柜',
                    cost:'799.00'
                },
                {
                    name:'8',
                    message:'霓峰厨房置物架落地多层蔬菜收纳架家用多功能杂物架靠墙零食储物架子 【加粗加厚款】50长（2网1板）',
                    cost:'79.90'
                },
                {
                    name:'9',
                    message:'简易衣橱家用卧室出租房宿舍全钢架加粗加厚组装大容量收纳布衣柜 长84*宽46*高173【灰色条纹】',
                    cost:'132.00'
                },
                {
                    name:'10',
                    message:'陶瓷筷子家用套装防霉防滑耐高温不变形家庭勺子餐具易清洗 纯白色筷子【1双装】',
                    cost:'18.62'
                },
                {
                    name:'11',
                    message:'IGIFTFIRE定制长虹玻璃定制超白艺术玻璃石头纹钻石纹水波纹小灯芯水纹钢化 定制 联系客服提供尺寸',
                    cost:'10.00'
                },
                {
                    name:'12',
                    message:'丝家迪北欧极简约现代免洗科技布艺羽绒沙发组合小户型客厅轻奢大深坐 2米直排沙发',
                    cost:'3258.00'
                },
                {
                    name:'13',
                    message:'汽车底盘装甲漆自喷型底盘防锈漆地盘装甲漆防水降噪防震防噪隔音自喷漆手喷漆 黑色底盘装甲 700ML 1瓶装',
                    cost:'12.64'
                },
                {
                    name:'14',
                    message:'皇朝怡景乌金木实木沙发新中式沙发冬夏两用现代中式沙发客厅2024新款家具 1+2+3+长茶几+小方几*2+电视柜 组合 高箱储物款（进口乌金木）',
                    cost:'12860.00'
                },
            
                {
                    name:'15',
                    message:'齐选汽车摆件中控台屏幕迷你车载龙年新款男女创意可爱车内装饰品通用 趴趴公仔-全家福',
                    cost:'12.15'
                },
                {
                    name:'16',
                    message:'欧立扬（OULIYANG）免安装折叠衣柜简易衣柜全钢架28mm钢管加粗布衣柜出租房宿舍衣橱 【长195cm】淡雅米（多隔层B款）',
                    cost:'392.00'
                },
                {
                    name:'17',
                    message:'第三星种【当天达】2024新款超薄十核4K超清全面屏全网通5G娱乐游戏学习二合一教育影音平板电脑 流光银丨12+256G丨X30+定制原装鼠标键盘',
                    cost:'450.00'
                },
                {
                    name:'18',
                    message:' 茗育 新国标电动自行车48V小型电瓶车小幻影男女款代步车电动车 魅力蓝【可上牌可提充电】 12Ah专用电池助力约80里',
                    cost:'722.86'
                },
                {
                    name:'19',
                    message:'黑猫比特【超级快充有快充线】充电宝快充可上飞机小巧便携适用华为手机小米苹果移动电源20000M大容量毫安 旗舰版+快充线【双向超级快充】 适用华为小米苹果专·用oppo一加vivo手机',
                    cost:'47.00'
                },
                {
                    name:'20',
                    message:'牧途衣柜卧室实木质平开门储物衣橱简易家用柜子收纳大衣柜 80cm两门主柜',
                    cost:'336.00'
                },
            
                {
                    name:'21',
                    message:'H&U&W国行【2024新英特尔+酷睿i7】笔记本电脑轻薄本大学生办公便携高性能游戏本商务设计AI标压手提本 【14代14英寸版】英特尔全面屏+IPS护眼抗蓝光 8G内存/128G超速硬盘',
                    cost:'966.00'
                },
                {
                    name:'22',
                    message:'衣柜推拉门卧室出租房简约挂衣服柜子小户型家用衣橱实木储物立柜 深胡桃【自主安装送工具】 【80*180cm】单柜',
                    cost:'193.00'
                },
                {
                    name:'23',
                    message:'HVWEI PadPro 2024新款平板电脑超高清2K全面屏游戏娱乐办公网课二合一平板 深空灰 14英新Pro至尊版16G+128G键盘鼠标皮套',
                    cost:'2199.00'
                },
            
                {
                    name:'24',
                    message:'家丽·春天 免安装折叠衣柜加固烤漆钢管全钢架简易布衣柜家用卧室收纳衣橱 2.0米创意空间（加厚碳钢管)',
                    cost:'317.70'
                },
                {
                    name:'25',
                    message:'夏新Amoi迷你小冰箱mini车家两用学生宿舍租房母乳冷藏一人便携柜车载 KS-6L 家用 标准款（仅家用） 6L',
                    cost:'08.00'
                },
                {
                    name:'26',
                    message:'NGIA智能嵌入式led灯橱柜灯感应灯条柜底灯衣柜灯带酒柜书柜层板灯 定制尺寸0.1米-3米',
                    cost:'10.00'
                },
                {
                    name:'27',
                    message:'京匠小货车车厢铺车底垫胶垫橡胶垫垫子加厚防滑夹线橡胶皮子后备箱垫 定制专拍（联系客服询价）',
                    cost:'10.00'
                },
                {
                    name:'28',
                    message:'缘庆新款汽车轮胎发光气门嘴帽车用车载夜光气嘴盖通用气门芯帽 升级带夜光【4个装】-一路平安',
                    cost:'12.74'
                },
                {
                    name:'29',
                    message:'逸卡锋芒雨刮器原厂无骨雨刷片汽车雨刮胶条下单备注车型年款一对装',
                    cost:'69.00'
                },
                {
                    name:'30',
                    message:'美孚（Mobil）美孚1号先进全合成汽机油小金美0W-40经典表现SP 1L 汽车保养',
                    cost:'84.00'
                },
                {
                    name:'31',
                    message:'OPOP平板电脑 2024新款 D23超高清全面屏平板电脑二合一全网通5GWiFi十核游戏办公网课娱乐 浅蓝色 16+128G 官方正品',
                    cost:'498.00'
                },
                {
                    name:'32',
                    message:'萨克斯（SACHS）汽车减震器/避震 后减一对奔驰E200/E260/E350/E400（C207/A207单门/敞篷）',
                    cost:'2031.75'
                },
                {
                    name:'33',
                    message:'AOVOPRO电动滑板车便携两轮代步车折叠电动车代驾折叠电瓶车锂电池带座位 48V-座椅版/可载人/不上牌/30km',
                    cost:'2099.00'
                },
            
                {
                    name:'34',
                    message:'雅兰阁铝合金阳光房定制户外别墅断桥铝庭院楼顶花园钢化玻璃门窗封阳台 全国测量诚意金',
                    cost:'294.00'
                },
                {
                    name:'35',
                    message:'红嫣嫣沙发客厅2024新款小户型奶油风家用现代简约直排猫抓皮三人四人位 米黄色【猫抓皮】 六人位3.4m+脚踏【乳胶款】',
                    cost:'3200.00'
                },
                {
                    name:'36',
                    message:'享惠油适配大众迈腾速腾途观新帕萨特明锐昊锐高6脚踏板刹车防滑垫胶套 自动档 刹车踏板胶垫',
                    cost:'23.00'
                }
            ]
        }
    },
}
